{
    "architectures": [
        "T5ForConditionalGeneration"
    ],
    "d_ff": 1024,
    "d_kv": 64,
    "d_model": 128,
    "dropout_rate": 0.1,
    "initializer_factor": 1.0,
    "is_encoder_decoder": true,
    "layer_norm_epsilon": 1e-06,
    "model_type": "t5",
    "n_positions": 512,
    "num_heads": 6,
    "num_layers": 4,
    "bos_token_id": 0,
    "eos_token_id": 1,
    "pad_token_id": 0,
    "decoder_start_token_id": 0,
    "relative_attention_num_buckets": 32
}